Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: يوم نطوي السماء كطي السجل للكتب كما بدأنا أول خلق نعيده وعدا علينا إنا كنا فاعلين
en: The Day when We shall roll up the heavens as a recorder rolleth up a written scroll. As We began the first creation, We shall repeat it. (It is) a promise (binding) upon Us. Lo! We are to perform it.

source: ولقد كتبنا في الزبور من بعد الذكر أن الأرض يرثها عبادي الصالحون
en: And verily we have written in the Scripture, after the Reminder: My righteous slaves will inherit the earth:

source: إن في هذا لبلاغا لقوم عابدين
en: Lo! there is a plain statement for folk who are devout.

source: وما أرسلناك إلا رحمة للعالمين
en: We sent thee not save as a mercy for the peoples.

source: قل إنما يوحى إلي أنما إلهكم إله واحد فهل أنتم مسلمون
en: Say: It is only inspired in me that your Allah is One Allah. Will ye then surrender (unto Him)?

source: فإن تولوا فقل آذنتكم على سواء وإن أدري أقريب أم بعيد ما توعدون
en: But if they are averse, then say: I have warned you all alike, although I know not whether nigh or far is that which ye are promised.

source: إنه يعلم الجهر من القول ويعلم ما تكتمون
en: Lo! He knoweth that which is said openly, and that which ye conceal.

source: وإن أدري لعله فتنة لكم ومتاع إلى حين
en: And I know not but that this may be a trial for you, and enjoyment for a while.

source: قال رب احكم بالحق وربنا الرحمن المستعان على ما تصفون
en: He saith: My Lord! Judge Thou with truth. Our Lord is the Beneficent, Whose help is to be implored against that which ye ascribe (unto Him).

source: يا أيها الناس اتقوا ربكم إن زلزلة الساعة شيء عظيم
en: O mankind! Fear your Lord. Lo! the earthquake of the Hour (of Doom) is a tremendous thing.

source: يوم ترونها تذهل كل مرضعة عما أرضعت وتضع كل ذات حمل حملها وترى الناس سكارى وما هم بسكارى ولكن عذاب الله شديد
en: On the day when ye behold it, every nursing mother will forget her nursling and every pregnant one will be delivered of her burden, and thou (Muhammad) wilt see mankind as drunken, yet they will not be drunken, but the Doom of Allah will be strong (upon them).

source: ومن الناس من يجادل في الله بغير علم ويتبع كل شيطان مريد
en: Among mankind is he who disputeth concerning Allah without knowledge, and followeth each froward devil;

source: كتب عليه أنه من تولاه فأنه يضله ويهديه إلى عذاب السعير
en: For him it is decreed that whoso taketh him for friend, he verily will mislead him and will guide him to the punishment of the Flame.

source: يا أيها الناس إن كنتم في ريب من البعث فإنا خلقناكم من تراب ثم من نطفة ثم من علقة ثم من مضغة مخلقة وغير مخلقة لنبين لكم ونقر في الأرحام ما نشاء إلى أجل مسمى ثم نخرجكم طفلا ثم لتبلغوا أشدكم ومنكم من يتوفى ومنكم من يرد إلى أرذل العمر لكيلا يعلم من بعد علم شيئا وترى الأرض هامدة فإذا أنزلنا عليها الماء اهتزت وربت وأنبتت من كل زوج بهيج
en: O mankind! if ye are in doubt concerning the Resurrection, then lo! We have created you from dust, then from a drop of seed, then from a clot, then from a little lump of flesh shapely and shapeless, that We may make (it) clear for you. And We cause what We will to remain in the wombs for an appointed time, and afterward We bring you forth as infants, then (give you growth) that ye attain your full strength. And among you there is he who dieth (young), and among you there is he who is brought back to the most abject time of life, so that, after knowledge, he knoweth naught. And thou (Muhammad) seest the earth barren, but when We send down water thereon, it doth thrill and swell and put forth every lovely kind (of growth).

source: ذلك بأن الله هو الحق وأنه يحيي الموتى وأنه على كل شيء قدير
en: That is because Allah, He is the Truth and because He quickeneth the dead, and because He is Able to do all things;

source: وأن الساعة آتية لا ريب فيها وأن الله يبعث من في القبور
en: And because the Hour will come, there is no doubt thereof; and because Allah will raise those who are in the graves.

source: ومن الناس من يجادل في الله بغير علم ولا هدى ولا كتاب منير
en: And among mankind is he who disputeth concerning Allah without knowledge or guidance or a scripture giving light,

source: ثاني عطفه ليضل عن سبيل الله له في الدنيا خزي ونذيقه يوم القيامة عذاب الحريق
en: Turning away in pride to beguile (men) from the way of Allah. For him in this world is ignominy, and on the Day of Resurrection We make him taste the doom of burning.

source: ذلك بما قدمت يداك وأن الله ليس بظلام للعبيد
en: (And unto him it will be said): This is for that which thy two hands have sent before, and because Allah is no oppressor of His slaves.

source: ومن الناس من يعبد الله على حرف فإن أصابه خير اطمأن به وإن أصابته فتنة انقلب على وجهه خسر الدنيا والآخرة ذلك هو الخسران المبين
en: And among mankind is he who worshippeth Allah upon a narrow marge so that if good befalleth him he is content therewith, but if a trial befalleth him, he falleth away utterly. He loseth both the world and the Hereafter. That is the sheer loss.

source: يدعو من دون الله ما لا يضره وما لا ينفعه ذلك هو الضلال البعيد
en: He calleth, beside Allah, unto that which hurteth him not nor benefiteth him. That is the far error.

source: يدعو لمن ضره أقرب من نفعه لبئس المولى ولبئس العشير
en: He calleth unto him whose harm is nearer than his benefit; verily an evil patron and verily an evil friend!

source: إن الله يدخل الذين آمنوا وعملوا الصالحات جنات تجري من تحتها الأنهار إن الله يفعل ما يريد
en: Lo! Allah causeth those who believe and do good works to enter Gardens underneath which rivers flow. Lo! Allah doth what He intendeth.

source: من كان يظن أن لن ينصره الله في الدنيا والآخرة فليمدد بسبب إلى السماء ثم ليقطع فلينظر هل يذهبن كيده ما يغيظ
en: Whoso is wont to think (through envy) that Allah will not give him (Muhammad) victory in the world and the Hereafter (and is enraged at the thought of his victory), let him stretch a rope up to the roof (of his dwelling), and let him hang himself. Then let him see whether his strategy dispelleth that whereat he rageth!.

source: وكذلك أنزلناه آيات بينات وأن الله يهدي من يريد
en: Thus We reveal it as plain revelations, and verily Allah guideth whom He will.

source: إن الذين آمنوا والذين هادوا والصابئين والنصارى والمجوس والذين أشركوا إن الله يفصل بينهم يوم القيامة إن الله على كل شيء شهيد
en: Lo! those who believe (this revelation), and those who are Jews, and the Sabaeans and the Christians and the Magians and the idolaters - Lo! Allah will decide between them on the Day of Resurrection. Lo! Allah is Witness over all things.

source: ألم تر أن الله يسجد له من في السماوات ومن في الأرض والشمس والقمر والنجوم والجبال والشجر والدواب وكثير من الناس وكثير حق عليه العذاب ومن يهن الله فما له من مكرم إن الله يفعل ما يشاء
en: Hast thou not seen that unto Allah payeth adoration whosoever is in the heavens and whosoever is in the earth, and the sun, and the moon, and the stars, and the hills, and the trees, and the beasts, and many of mankind, while there are many unto whom the doom is justly due. He whom Allah scorneth, there is none to give him honour. Lo! Allah doeth what He will.

source: هذان خصمان اختصموا في ربهم فالذين كفروا قطعت لهم ثياب من نار يصب من فوق رءوسهم الحميم
en: These twain (the believers and the disbelievers) are two opponents who contend concerning their Lord. But as for those who disbelieve, garments of fire will be cut out for them; boiling fluid will be poured down on their heads,

source: يصهر به ما في بطونهم والجلود
en: Whereby that which is in their bellies, and their skins too, will be melted;

source: ولهم مقامع من حديد
en: And for them are hooked rods of iron.

source: كلما أرادوا أن يخرجوا منها من غم أعيدوا فيها وذوقوا عذاب الحريق
en: Whenever, in their anguish, they would go forth from thence they are driven back therein and (it is said unto them): Taste the doom of burning.

source: إن الله يدخل الذين آمنوا وعملوا الصالحات جنات تجري من تحتها الأنهار يحلون فيها من أساور من ذهب ولؤلؤا ولباسهم فيها حرير
en: Lo! Allah will cause those who believe and do good works to enter Gardens underneath which rivers flow, wherein they will be allowed armlets of gold, and pearls, and their raiment therein will be silk.

source: وهدوا إلى الطيب من القول وهدوا إلى صراط الحميد
en: They are guided unto gentle speech; they are guided unto the path of the Glorious One.

source: إن الذين كفروا ويصدون عن سبيل الله والمسجد الحرام الذي جعلناه للناس سواء العاكف فيه والباد ومن يرد فيه بإلحاد بظلم نذقه من عذاب أليم
en: Lo! those who disbelieve and bar (men) from the way of Allah and from the Inviolable Place of Worship, which We have appointed for mankind together, the dweller therein and the nomad: whosoever seeketh wrongful partiality therein, him We shall cause to taste a painful doom.

source: وإذ بوأنا لإبراهيم مكان البيت أن لا تشرك بي شيئا وطهر بيتي للطائفين والقائمين والركع السجود
en: And (remember) when We prepared for Abraham the place of the (holy) House, saying: Ascribe thou no thing as partner unto Me, and purify My House for those who make the round (thereof) and those who stand and those who bow and make prostration.

source: وأذن في الناس بالحج يأتوك رجالا وعلى كل ضامر يأتين من كل فج عميق
en: And proclaim unto mankind the pilgrimage. They will come unto thee on foot and on every lean camel; they will come from every deep ravine,

source: ليشهدوا منافع لهم ويذكروا اسم الله في أيام معلومات على ما رزقهم من بهيمة الأنعام فكلوا منها وأطعموا البائس الفقير
en: That they may witness things that are of benefit to them, and mention the name of Allah on appointed days over the beast of cattle that He hath bestowed upon them. Then eat thereof and feed therewith the poor unfortunate.

source: ثم ليقضوا تفثهم وليوفوا نذورهم وليطوفوا بالبيت العتيق
en: Then let them make an end of their unkemptness and pay their vows and go around the ancient House.

source: ذلك ومن يعظم حرمات الله فهو خير له عند ربه وأحلت لكم الأنعام إلا ما يتلى عليكم فاجتنبوا الرجس من الأوثان واجتنبوا قول الزور
en: That (is the command). And whoso magnifieth the sacred things of Allah, it will be well for him in the sight of his Lord. The cattle are lawful unto you save that which hath been told you. So shun the filth of idols, and shun lying speech,

source: حنفاء لله غير مشركين به ومن يشرك بالله فكأنما خر من السماء فتخطفه الطير أو تهوي به الريح في مكان سحيق
en: Turning unto Allah (only), not ascribing partners unto Him; for whoso ascribeth partners unto Allah, it is as if he had fallen from the sky and the birds had snatched him or the wind had blown him to a far-off place.

source: ذلك ومن يعظم شعائر الله فإنها من تقوى القلوب
en: That (is the command). And whoso magnifieth the offerings consecrated to Allah, it surely is from devotion of the hearts,

source: لكم فيها منافع إلى أجل مسمى ثم محلها إلى البيت العتيق
en: Therein are benefits for you for an appointed term; and afterward they are brought for sacrifice unto the ancient House.

source: ولكل أمة جعلنا منسكا ليذكروا اسم الله على ما رزقهم من بهيمة الأنعام فإلهكم إله واحد فله أسلموا وبشر المخبتين
en: And for every nation have We appointed a ritual, that they may mention the name of Allah over the beast of cattle that He hath given them for food; and your god is One God, therefor surrender unto Him. And give good tidings (O Muhammad) to the humble,

source: الذين إذا ذكر الله وجلت قلوبهم والصابرين على ما أصابهم والمقيمي الصلاة ومما رزقناهم ينفقون
en: Whose hearts fear when Allah is mentioned, and the patient of whatever may befall them, and those who establish worship and who spend of that We have bestowed on them.

source: والبدن جعلناها لكم من شعائر الله لكم فيها خير فاذكروا اسم الله عليها صواف فإذا وجبت جنوبها فكلوا منها وأطعموا القانع والمعتر كذلك سخرناها لكم لعلكم تشكرون
en: And the camels! We have appointed them among the ceremonies of Allah. Therein ye have much good. So mention the name of Allah over them when they are drawn up in lines. Then when their flanks fall (dead), eat thereof and feed the beggar and the suppliant. Thus have We made them subject unto you, that haply ye may give thanks.

source: لن ينال الله لحومها ولا دماؤها ولكن يناله التقوى منكم كذلك سخرها لكم لتكبروا الله على ما هداكم وبشر المحسنين
en: Their flesh and their food reach not Allah, but the devotion from you reacheth Him. Thus have We made them subject unto you that ye may magnify Allah that He hath guided you. And give good tidings (O Muhammad) to the good.

source: إن الله يدافع عن الذين آمنوا إن الله لا يحب كل خوان كفور
en: Lo! Allah defendeth those who are true. Lo! Allah loveth not each treacherous ingrate.

source: أذن للذين يقاتلون بأنهم ظلموا وإن الله على نصرهم لقدير
en: Sanction is given unto those who fight because they have been wronged; and Allah is indeed Able to give them victory;

source: الذين أخرجوا من ديارهم بغير حق إلا أن يقولوا ربنا الله ولولا دفع الله الناس بعضهم ببعض لهدمت صوامع وبيع وصلوات ومساجد يذكر فيها اسم الله كثيرا ولينصرن الله من ينصره إن الله لقوي عزيز
en: Those who have been driven from their homes unjustly only because they said: Our Lord is Allah - For had it not been for Allah's repelling some men by means of others, cloisters and churches and oratories and mosques, wherein the name of Allah is oft mentioned, would assuredly have been pulled down. Verily Allah helpeth one who helpeth Him. Lo! Allah is Strong, Almighty -

source: الذين إن مكناهم في الأرض أقاموا الصلاة وآتوا الزكاة وأمروا بالمعروف ونهوا عن المنكر ولله عاقبة الأمور
en: Those who, if We give them power in the land, establish worship and pay the poor-due and enjoin kindness and forbid iniquity. And Allah's is the sequel of events.

source: وإن يكذبوك فقد كذبت قبلهم قوم نوح وعاد وثمود
en: If they deny thee (Muhammad), even so the folk of Noah, and (the tribes of) A'ad and Thamud, before thee, denied (Our messengers);

source: وقوم إبراهيم وقوم لوط
en: And the folk of Abraham and the folk of Lot;

source: وأصحاب مدين وكذب موسى فأمليت للكافرين ثم أخذتهم فكيف كان نكير
en: (And) the dwellers in Midian. And Moses was denied; but I indulged the disbelievers a long while, then I seized them, and how (terrible) was My abhorrence!

source: فكأين من قرية أهلكناها وهي ظالمة فهي خاوية على عروشها وبئر معطلة وقصر مشيد
en: How many a township have We destroyed while it was sinful, so that it lieth (to this day) in ruins, and (how many) a deserted well and lofty tower!

source: أفلم يسيروا في الأرض فتكون لهم قلوب يعقلون بها أو آذان يسمعون بها فإنها لا تعمى الأبصار ولكن تعمى القلوب التي في الصدور
en: Have they not travelled in the land, and have they hearts wherewith to feel and ears wherewith to hear? For indeed it is not the eyes that grow blind, but it is the hearts, which are within the bosoms, that grow blind.

source: ويستعجلونك بالعذاب ولن يخلف الله وعده وإن يوما عند ربك كألف سنة مما تعدون
en: And they will bid thee hasten on the Doom, and Allah faileth not His promise, but lo! a Day with Allah is as a thousand years of what ye reckon.

source: وكأين من قرية أمليت لها وهي ظالمة ثم أخذتها وإلي المصير
en: And how many a township did I suffer long though it was sinful! Then I grasped it. Unto Me is the return.

source: قل يا أيها الناس إنما أنا لكم نذير مبين
en: Say: O mankind! I am only a plain warner unto you.

source: فالذين آمنوا وعملوا الصالحات لهم مغفرة ورزق كريم
en: Those who believe and do good works, for them is pardon and a rich provision;

source: والذين سعوا في آياتنا معاجزين أولئك أصحاب الجحيم
en: While those who strive to thwart Our revelations, such are rightful owners of the Fire.

source: وما أرسلنا من قبلك من رسول ولا نبي إلا إذا تمنى ألقى الشيطان في أمنيته فينسخ الله ما يلقي الشيطان ثم يحكم الله آياته والله عليم حكيم
en: Never sent We a messenger or a prophet before thee but when He recited (the message) Satan proposed (opposition) in respect of that which he recited thereof. But Allah abolisheth that which Satan proposeth. Then Allah establisheth His revelations. Allah is Knower, Wise;

source: ليجعل ما يلقي الشيطان فتنة للذين في قلوبهم مرض والقاسية قلوبهم وإن الظالمين لفي شقاق بعيد
en: That He may make that which the devil proposeth a temptation for those in whose hearts is a disease, and those whose hearts are hardened - Lo! the evil-doers are in open schism -

source: وليعلم الذين أوتوا العلم أنه الحق من ربك فيؤمنوا به فتخبت له قلوبهم وإن الله لهاد الذين آمنوا إلى صراط مستقيم
en: And that those who have been given knowledge may know that it is the truth from thy Lord, so that they may believe therein and their hearts may submit humbly unto Him. Lo! Allah verily is guiding those who believe unto a right path.

source: ولا يزال الذين كفروا في مرية منه حتى تأتيهم الساعة بغتة أو يأتيهم عذاب يوم عقيم
en: And those who disbelieve will not cease to be in doubt thereof until the Hour come upon them unawares, or there come unto them the doom of a disastrous day.

source: الملك يومئذ لله يحكم بينهم فالذين آمنوا وعملوا الصالحات في جنات النعيم
en: The Sovereignty on that day will be Allah's, He will judge between them. Then those who believed and did good works will be in Gardens of Delight,

source: والذين كفروا وكذبوا بآياتنا فأولئك لهم عذاب مهين
en: While those who disbelieved and denied Our revelations, for them will be a shameful doom.

source: والذين هاجروا في سبيل الله ثم قتلوا أو ماتوا ليرزقنهم الله رزقا حسنا وإن الله لهو خير الرازقين
en: Those who fled their homes for the cause of Allah and then were slain or died, Allah verily will provide for them a good provision. Lo! Allah, He verily is Best of all who make provision.

source: ليدخلنهم مدخلا يرضونه وإن الله لعليم حليم
en: Assuredly He will cause them to enter by an entry that they will love. Lo! Allah verily is Knower, Indulgent.

source: ذلك ومن عاقب بمثل ما عوقب به ثم بغي عليه لينصرنه الله إن الله لعفو غفور
en: That (is so). And whoso hath retaliated with the like of that which he was made to suffer and then hath (again) been wronged, Allah will succour him. Lo! Allah verily is Mild, Forgiving.

source: ذلك بأن الله يولج الليل في النهار ويولج النهار في الليل وأن الله سميع بصير
en: That is because Allah maketh the night to pass into the day and maketh the day to pass into the night, and because Allah is Hearer, Seer.

source: ذلك بأن الله هو الحق وأن ما يدعون من دونه هو الباطل وأن الله هو العلي الكبير
en: That is because Allah, He is the True, and that whereon they call instead of Him, it is the false, and because Allah, He is the High, the Great.

source: ألم تر أن الله أنزل من السماء ماء فتصبح الأرض مخضرة إن الله لطيف خبير
en: Seest thou not how Allah sendeth down water from the sky and then the earth becometh green upon the morrow? Lo! Allah is Subtile, Aware.

source: له ما في السماوات وما في الأرض وإن الله لهو الغني الحميد
en: Unto Him belongeth all that is in the heavens and all that is in the earth. Lo! Allah, He verily is the Absolute, the Owner of Praise.

source: ألم تر أن الله سخر لكم ما في الأرض والفلك تجري في البحر بأمره ويمسك السماء أن تقع على الأرض إلا بإذنه إن الله بالناس لرءوف رحيم
en: Hast thou not seen how Allah hath made all that is in the earth subservient unto you? And the ship runneth upon the sea by His command, and He holdeth back the heaven from falling on the earth unless by His leave. Lo! Allah is, for mankind, Full of Pity, Merciful.

source: وهو الذي أحياكم ثم يميتكم ثم يحييكم إن الإنسان لكفور
en: And He it is Who gave you life, then He will cause you to die, and then will give you life (again). Lo! man is verily an ingrate.

source: لكل أمة جعلنا منسكا هم ناسكوه فلا ينازعنك في الأمر وادع إلى ربك إنك لعلى هدى مستقيم
en: Unto each nation have We given sacred rites which they are to perform; so let them not dispute with thee of the matter, but summon thou unto thy Lord. Lo! thou indeed followest right guidance.

source: وإن جادلوك فقل الله أعلم بما تعملون
en: And if they wrangle with thee, say: Allah is Best Aware of what ye do.

source: الله يحكم بينكم يوم القيامة فيما كنتم فيه تختلفون
en: Allah will judge between you on the Day of Resurrection concerning that wherein ye used to differ.

source: ألم تعلم أن الله يعلم ما في السماء والأرض إن ذلك في كتاب إن ذلك على الله يسير
en: Hast thou not known that Allah knoweth all that is in the heaven and the earth? Lo! it is in a record. Lo! that is easy for Allah.

source: ويعبدون من دون الله ما لم ينزل به سلطانا وما ليس لهم به علم وما للظالمين من نصير
en: And they worship instead of Allah that for which He hath sent down no warrant, and that whereof they have no knowledge. For evil-doers there is no helper.

source: وإذا تتلى عليهم آياتنا بينات تعرف في وجوه الذين كفروا المنكر يكادون يسطون بالذين يتلون عليهم آياتنا قل أفأنبئكم بشر من ذلكم النار وعدها الله الذين كفروا وبئس المصير
en: And when Our revelations are recited unto them, thou knowest the denial in the faces of those who disbelieve; they all but attack those who recite Our revelations unto them. Say: Shall I proclaim unto you worse than that? The Fire! Allah hath promised it for those who disbelieve. A hapless journey's end!

source: يا أيها الناس ضرب مثل فاستمعوا له إن الذين تدعون من دون الله لن يخلقوا ذبابا ولو اجتمعوا له وإن يسلبهم الذباب شيئا لا يستنقذوه منه ضعف الطالب والمطلوب
en: O mankind! A similitude is coined, so pay ye heed to it: Lo! those on whom ye call beside Allah will never create a fly though they combine together for the purpose. And if the fly took something from them, they could not rescue it from it. So weak are (both) the seeker and the sought!

source: ما قدروا الله حق قدره إن الله لقوي عزيز
en: They measure not Allah His rightful measure. Lo! Allah is Strong, Almighty.

source: الله يصطفي من الملائكة رسلا ومن الناس إن الله سميع بصير
en: Allah chooseth from the angels messengers, and (also) from mankind. Lo! Allah is Hearer, Seer.

source: يعلم ما بين أيديهم وما خلفهم وإلى الله ترجع الأمور
en: He knoweth all that is before them and all that is behind them, and unto Allah all things are returned. $$A

source: يا أيها الذين آمنوا اركعوا واسجدوا واعبدوا ربكم وافعلوا الخير لعلكم تفلحون
en: O ye who believe! Bow down and prostrate yourselves, and worship your Lord, and do good, that haply ye may prosper.

source: وجاهدوا في الله حق جهاده هو اجتباكم وما جعل عليكم في الدين من حرج ملة أبيكم إبراهيم هو سماكم المسلمين من قبل وفي هذا ليكون الرسول شهيدا عليكم وتكونوا شهداء على الناس فأقيموا الصلاة وآتوا الزكاة واعتصموا بالله هو مولاكم فنعم المولى ونعم النصير
en: And strive for Allah with the endeavour which is His right. He hath chosen you and hath not laid upon you in religion any hardship; the faith of your father Abraham (is yours). He hath named you Muslims of old time and in this (Scripture), that the messenger may be a witness against you, and that ye may be witnesses against mankind. So establish worship, pay the poor-due, and hold fast to Allah. He is your Protecting friend. A blessed Patron and a blessed Helper!

source: قد أفلح المؤمنون
en: Successful indeed are the believers

source: الذين هم في صلاتهم خاشعون
en: Who are humble in their prayers,

source: والذين هم عن اللغو معرضون
en: And who shun vain conversation,

source: والذين هم للزكاة فاعلون
en: And who are payers of the poor-due;

source: والذين هم لفروجهم حافظون
en: And who guard their modesty -

source: إلا على أزواجهم أو ما ملكت أيمانهم فإنهم غير ملومين
en: Save from their wives or the (slaves) that their right hands possess, for then they are not blameworthy,

source: فمن ابتغى وراء ذلك فأولئك هم العادون
en: But whoso craveth beyond that, such are transgressors -

source: والذين هم لأماناتهم وعهدهم راعون
en: And who are shepherds of their pledge and their covenant,

source: والذين هم على صلواتهم يحافظون
en: And who pay heed to their prayers.

source: أولئك هم الوارثون
en: These are the heirs

source: الذين يرثون الفردوس هم فيها خالدون
en: Who will inherit paradise. There they will abide.

source: ولقد خلقنا الإنسان من سلالة من طين
en: Verily We created man from a product of wet earth;

source: ثم جعلناه نطفة في قرار مكين
en: Then placed him as a drop (of seed) in a safe lodging;
